Reports/гз_ИсполнениеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>гз_ИсполнениеДоговоров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСравненияОрганизации</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</v8:Type>
						<v8:Type>cfg:CatalogRef.гз_ПроведенныеЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарубежныйПоставщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерШтрафа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СостоянияДоговоровПоГосударственнымЗакупкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СпособыОплатыПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаШтрафа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СпособыРасчетаШтрафа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субподрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубъектМалогоПредпринимательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товаропроизводитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гз_СтатусыДоговоровПоГосударственнымЗакупкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_СтатусыДоговоровПоГосударственнымЗакупкам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СтатусыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/гз_СтатусыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>гз_СтатусыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статус_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статус_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статус_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статус_3</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/гз_ИсполнениеДоговоров/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

Функция СформироватьЗапрос()
	
	мВидыСубконто = Новый Массив;
	//мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты);
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Договоры);
	
	мСписокСчетов = Новый Массив;
	мСписокСчетов.Добавить(ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам);
	мСписокСчетов.Добавить(ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоАренде);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачалоГода(Год)));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонецГода(Год)));
	Запрос.УстановитьПараметр("мВидыСубконто", мВидыСубконто);
	Запрос.УстановитьПараметр("мСписокСчетов", мСписокСчетов);
	Запрос.УстановитьПараметр("выбГод", Год);
	
	ТекстУсловия = "";
	ТекстДопУсловия = "";
	Союз = " И ";
	
	Если ОтборОрганизации Тогда
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияОрганизацииСтрокой = " = &Организация" 
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияОрганизацииСтрокой = " <> &Организация"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияОрганизацииСтрокой = " В (&Организация)"
		Иначе
			ВидСравненияОрганизацииСтрокой = " НЕ В (&Организация)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + Союз + "Организация " + ВидСравненияОрганизацииСтрокой;
		ТекстДопУсловия = "Организация " + ВидСравненияОрганизацииСтрокой;
		Союз         = " И ";
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕстьNull(гз_СтатусыДоговоровПоГосударственнымЗакупкамСрезПоследних.Статус,ЗНАЧЕНИЕ(Перечисление.гз_СтатусыДоговоров.Статус_0)) КАК СтатусДоговора,
	|	гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Регистратор КАК Регистратор,
	|	гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Сумма КАК СуммаПоДоговору,
	|	ЕстьNull(ДанныеПОБУ.СуммаОплаты,0) КАК ОплаченнаяСумма,
	|	ЕстьNull(ДанныеПОБУ.СуммаПоставки,0) КАК СуммаПоставки
	|
	|ИЗ
	|	РегистрСведений.гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам КАК гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гз_СтатусыДоговоровПоГосударственнымЗакупкам.СрезПоследних(&КонПериода, ) КАК гз_СтатусыДоговоровПоГосударственнымЗакупкамСрезПоследних
	|		ПО  гз_СтатусыДоговоровПоГосударственнымЗакупкамСрезПоследних.ДоговорКонтрагента = гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.ДоговорКонтрагента
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|         (ВЫБРАТЬ
	|				ТиповойОбороты.Субконто1 КАК ДоговорКонтрагента,
	|				ТиповойОбороты.СуммаОборотДт КАК СуммаОплаты,
	|				ТиповойОбороты.СуммаОборотКт КАК СуммаПоставки
	|			ИЗ
	|				РегистрБухгалтерии.Типовой.Обороты(&Начпериода, &КонПериода, , Счет В ИЕРАРХИИ (&мСписокСчетов), &мВидыСубконто, "+ТекстДопУсловия+", , ) КАК ТиповойОбороты
	|          ) КАК ДанныеПОБУ
	|   	ПО ДанныеПОБУ.ДоговорКонтрагента = гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.ДоговорКонтрагента
	|ГДЕ
	|	гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Год = &выбГод"+ТекстУсловия+"
	|ИТОГИ Сумма(СуммаПоДоговору),
	|      Сумма(ОплаченнаяСумма),
	|      Сумма(СуммаПоставки)
	|	ПО Общие";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапрос()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

Процедура СформироватьОтчет(ДокументРезультат) Экспорт	
	
	ДокументРезультат.Очистить();
	
	Макет 		 = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	СтрокаОтбора = "Отбор:";
	
	// Информация об отборе.
	Если ОтборОрганизации Тогда
		
		СписокОтборПоОрганизации = "";
		
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
			Иначе
				СписокОтборПоОрганизации = Организация
			КонецЕсли;
		Иначе
			Если Организация.Количество() = 0 Тогда
			Иначе	
				СписокОтборПоОрганизации =  Организация
			КонецЕсли; 
		КонецЕсли;
		//СтрокаОтбора = СтрокаОтбора + Символы.ПС + СписокОтбор;
		
	КонецЕсли;
	
	
	ОбластьЗаголовок.Параметры.СписокОтборПоОрганизации = СписокОтборПоОрганизации;
	//ОбластьШапка.Параметры.Отбор = СтрокаОтбора;
	
	ТекстПериода = Отчеты_БК.СформироватьСтрокуВыводаПараметровПоДатам(НачалоГода(Год), КонецГода(Год));
	ОбластьЗаголовок.Параметры.ПредставлениеЗаголовка = "Исполнение договоров за "+ТекстПериода;
	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ДокументРезультат.Вывести(ОбластьШапка);
	
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИТОГО = Макет.ПолучитьОбласть("ИТОГО");
	
	РЕзультат = СформироватьЗапрос();
	
	выборкаОбщие = РЕзультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
    выборкаОбщие.Следующий();
	
	ВыборкаПоДеталям = выборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомПП=0;
	
	Пока  ВыборкаПоДеталям.Следующий() Цикл
		
		ДокументРегистрации = ВыборкаПоДеталям.Регистратор;
		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоДеталям);
		
		ОбластьСтрока.Параметры.БИНЗаказчика = ДокументРегистрации.Организация.ИдентификационныйНомер;
		ОбластьСтрока.Параметры.РННЗаказчика = ДокументРегистрации.Организация.РНН;
		ОбластьСтрока.Параметры.НаименованиеКЗ = ДокументРегистрации.Организация.НаименованиеПолноеКЗ;
		ОбластьСтрока.Параметры.Наименование = ДокументРегистрации.Организация.НаименованиеПолное;
		ОбластьСтрока.Параметры.КОдЗаказчикаКАТО = ДокументРегистрации.Организация.КодПоКАТО;
		ОбластьСтрока.Параметры.НомерДоговора = ДокументРегистрации.НомерДоговора;
		ОбластьСтрока.Параметры.ДатаДоговора = ДокументРегистрации.ДатаДоговора;
		ОбластьСтрока.Параметры.ДатаОкончания = ДокументРегистрации.ДатаОкончанияДействияДоговора;
		ОбластьСтрока.Параметры.ПоставщикКЗ = ДокументРегистрации.Контрагент.НаименованиеПолноеКЗ;
		ОбластьСтрока.Параметры.Поставщик = ДокументРегистрации.Контрагент.НаименованиеПолное;
		ОбластьСтрока.Параметры.БИНПоставщика = ДокументРегистрации.Контрагент.ИдентификационныйКодЛичности;
		ОбластьСтрока.Параметры.РННПоставщика = ДокументРегистрации.Контрагент.РНН;
		ОбластьСтрока.Параметры.КодСтраныПоставщика = ?(ЗНАЧЕНИЕЗАПОЛНЕНО(ДокументРегистрации.Контрагент.СтранаРезидентства),ДокументРегистрации.Контрагент.СтранаРезидентства.Код,"398");
		ОбластьСтрока.Параметры.КодРегионаПоставщикаПоКАТО = ДокументРегистрации.Контрагент.КодПоКАТО;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;           	
	
		//ОбластьИТОГО.Параметры.Заполнить(выборкаОбщие);
		//ОбластьИТОГО.Параметры.ПредставлениеИтого = "Всего по области";
		//ДокументРезультат.Вывести(ОбластьИТОГО);
	
КонецПроцедуры // СформироватьОтчет()

#КонецЕсли
